In [26]:
import pandas as pd
from io import StringIO
data = 'price,count,percent\n1,10,\n2,20,51\n3,30,'
df = pd.read_csv(StringIO(data))
df

   price  count  percent
0      1     10      NaN
1      2     20     51.0
2      3     30      NaN

In [27]:
df.loc[3] = {'price':4, 'count':None, 'percent':26.3}
df

   price count  percent
0      1    10      NaN
1      2    20     51.0
2      3    30      NaN
3      4  None     26.3

In [28]:
pd.isnull(df)

   price  count  percent
0  False  False     True
1  False  False    False
2  False  False     True
3  False   True    False

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   price    4 non-null      int64
 1   count    3 non-null      object
 2   percent  2 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 128.0+ bytes

In [30]:
df.isnull().sum()

price      0
count      1
percent    2
dtype: int64

In [31]:
df

   price count  percent
0      1    10      NaN
1      2    20     51.0
2      3    30      NaN
3      4  None     26.3

In [32]:
df.fillna(0)

   price  count  percent
0      1     10      0.0
1      2     20     51.0
2      3     30      0.0
3      4      0     26.3

In [33]:
df.fillna(df.mean())

   price  count  percent
0      1   10.0    38.65
1      2   20.0    51.00
2      3   30.0    38.65
3      4   20.0    26.30

In [34]:
df.dropna()

   price count  percent
1      2    20     51.0

In [35]:
df.dropna(axis = 1)

   price
0      1
1      2
2      3
3      4

In [36]:
data2 = pd.read_csv(r'C:\Users\Тома\sample.csv')
data2

            Name         City  Age Profession
0         Иванов       Москва   25     Клинер
1            NaN    Волгоград   31   Менеджер
2         Иванов       Москва   25     Клинер
3        sidorov  Владивосток   43   Менеджер
4        _______        Курск   50   Водитель
5       Кузнецов         Сочи   19    Рабочий
6          Сажин       Сургут   29    Рабочий
7   Котлеревский   Йошкар-Ола   32    Рабочий
8     Завалишина    Чебоксары   36   Менеджер
9         Левина          NaN   55    Рабочий
10          Фикс         Рига   42    Рабочий

In [37]:
data3 = pd.read_csv(r'C:\Users\Тома\sample.csv', delimiter=';', names = ['Name', 'City', 'Age', 'Profession'])
data3

                                  Name  City  Age  Profession
0             Name,City,Age,Profession   NaN  NaN         NaN
1              Иванов,Москва,25,Клинер   NaN  NaN         NaN
2               ,Волгоград,31,Менеджер   NaN  NaN         NaN
3              Иванов,Москва,25,Клинер   NaN  NaN         NaN
4      sidorov,Владивосток,43,Менеджер   NaN  NaN         NaN
5            _______,Курск,50,Водитель   NaN  NaN         NaN
6             Кузнецов,Сочи,19,Рабочий   NaN  NaN         NaN
7              Сажин,Сургут,29,Рабочий   NaN  NaN         NaN
8   Котлеревский,Йошкар-Ола,32,Рабочий   NaN  NaN         NaN
9     Завалишина,Чебоксары,36,Менеджер   NaN  NaN         NaN
10                  Левина,,55,Рабочий   NaN  NaN         NaN
11                Фикс,Рига,42,Рабочий   NaN  NaN         NaN

In [38]:
sample = pd.read_csv(r'C:\Users\Тома\sample.csv')
columns=sample.columns
columns

Index(['Name', 'City', 'Age', 'Profession'], dtype='object')

In [39]:
sample = pd.read_csv(r'C:\Users\Тома\sample.csv')
columns=sample.columns
sample.columns2 = list(map(lambda name: name.lower(), columns))
sample.columns2

C:\Users\Тома\AppData\Local\Temp\ipykernel_15124\4291253883.py:3: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  sample.columns2 = list(map(lambda name: name.lower(), columns))

['name', 'city', 'age', 'profession']

In [40]:
sample.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        10 non-null     object
 1   City        10 non-null     object
 2   Age         11 non-null     int64
 3   Profession  11 non-null     object
dtypes: int64(1), object(3)
memory usage: 480.0+ bytes

In [41]:
sample['City'].unique()

array(['Москва', 'Волгоград', 'Владивосток', 'Курск', 'Сочи', 'Сургут',
       'Йошкар-Ола', 'Чебоксары', nan, 'Рига'], dtype=object)

In [42]:
sample2 = sample[sample.Age<30]
sample2

       Name    City  Age Profession
0    Иванов  Москва   25     Клинер
2    Иванов  Москва   25     Клинер
5  Кузнецов    Сочи   19    Рабочий
6     Сажин  Сургут   29    Рабочий

In [43]:
sample2=sample[(sample.Age<30) & (sample.Profession=='Рабочий')]
sample2

       Name    City  Age Profession
5  Кузнецов    Сочи   19    Рабочий
6     Сажин  Сургут   29    Рабочий

In [44]:
sample.query('Age>20')

            Name         City  Age Profession
0         Иванов       Москва   25     Клинер
1            NaN    Волгоград   31   Менеджер
2         Иванов       Москва   25     Клинер
3        sidorov  Владивосток   43   Менеджер
4        _______        Курск   50   Водитель
6          Сажин       Сургут   29    Рабочий
7   Котлеревский   Йошкар-Ола   32    Рабочий
8     Завалишина    Чебоксары   36   Менеджер
9         Левина          NaN   55    Рабочий
10          Фикс         Рига   42    Рабочий

In [45]:
sample.query('City in ["Рига","Сочи"]')

        Name  City  Age Profession
5   Кузнецов  Сочи   19    Рабочий
10      Фикс  Рига   42    Рабочий

In [46]:
sample.query('City in ["Рига", "Сочи","Чебоксары", "Сургут"] & 21<Age<50 & Profession!="Менеджер"')

     Name    City  Age Profession
6   Сажин  Сургут   29    Рабочий
10   Фикс    Рига   42    Рабочий

In [47]:
sample[sample.Name.str.match("К",na=False)]

           Name        City  Age Profession
5      Кузнецов        Сочи   19    Рабочий
7  Котлеревский  Йошкар-Ола   32    Рабочий

In [48]:
sample[sample.Name.str.match(pat='[А-Я].в',na=False)]

         Name       City  Age Profession
8  Завалишина  Чебоксары   36   Менеджер
9      Левина        NaN   55    Рабочий

In [49]:
sample2=sample
sample2.Age = sample2.Age.apply(lambda x:x + 1)
print(sample2)

            Name         City  Age Profession
0         Иванов       Москва   26     Клинер
1            NaN    Волгоград   32   Менеджер
2         Иванов       Москва   26     Клинер
3        sidorov  Владивосток   44   Менеджер
4        _______        Курск   51   Водитель
5       Кузнецов         Сочи   20    Рабочий
6          Сажин       Сургут   30    Рабочий
7   Котлеревский   Йошкар-Ола   33    Рабочий
8     Завалишина    Чебоксары   37   Менеджер
9         Левина          NaN   56    Рабочий
10          Фикс         Рига   43    Рабочий

In [50]:
sample2.City = sample2.City.apply(lambda s: str(s).lower())
print(sample2)

            Name         City  Age Profession
0         Иванов       москва   26     Клинер
1            NaN    волгоград   32   Менеджер
2         Иванов       москва   26     Клинер
3        sidorov  владивосток   44   Менеджер
4        _______        курск   51   Водитель
5       Кузнецов         сочи   20    Рабочий
6          Сажин       сургут   30    Рабочий
7   Котлеревский   йошкар-ола   33    Рабочий
8     Завалишина    чебоксары   37   Менеджер
9         Левина          nan   56    Рабочий
10          Фикс         рига   43    Рабочий